TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/dsp/dsp_fpu_fft_fpu64_f2838x.c
#include "c2000ware_libraries.h"
#include "driverlib.h"
#include "device.h"
#include "board.h"
#include "fpu.h"
#include "dsp.h"
#include "dsp_examples_setup.h"

float64_t test_input[1024] = {
    31.000000000000L,  0.000000000000L, 29.769646610604L,  8.638242341660L,
    26.177014608406L, 16.588199639409L, 20.509450684819L, 23.216865592711L,
    13.220052022653L, 27.997315603134L,  4.891151290503L, 30.550923522639L,
    -3.812578540813L, 30.677582417811L, -12.197592243420L, 28.371497884005L,
    -19.597177032425L, 23.821297975689L, -25.424883361015L, 17.394480016814L,
    -29.221365118585L,  9.607486724863L, -30.690858009203L,  1.083868053987L,
    -29.724376467653L, -7.496054112218L, -26.407796620237L, -15.449921912405L,
    -21.014225814088L, -22.148038328150L, -13.981336715817L, -27.063604894209L,
    -5.875561213969L, -29.814460211369L,  2.653903000737L, -30.192986618897L,
    10.927508081499L, -28.181828060795L, 18.289927272099L, -23.954225006747L,
    24.162363728021L, -17.859026204082L, 28.088388090930L, -10.391679000709L,
    29.769646610604L, -2.153628504621L, 29.088626517476L,  6.196520638700L,
    26.116733567402L, 13.996081730289L, 21.107139358960L, 20.631290235795L,
    14.473093893824L, 25.585961054555L,  6.753570481104L, 28.481911402048L,
    -1.430879738947L, 29.107961195275L, -9.428418857422L, 27.435275499291L,
    -16.608249790346L, 23.617939572670L, -22.410745530774L, 17.978862788147L,
    -26.391364902565L, 10.982293958583L, -28.254883577036L,  3.195300666632L,
    -27.877289510855L, -4.758567133555L, -25.313718920727L, -12.249612423554L,
    -20.791956303629L, -18.692228830925L, -14.692194784638L, -23.591000655514L,
    -7.514855174267L, -26.579009095295L,  0.160795577026L, -27.445364749525L,
     7.723778250183L, -26.149896022511L, 14.580421124700L, -22.823988672166L,
    20.201300754623L, -17.757704368047L, 24.162363728021L, -11.374412367043L,
    26.177014608406L, -4.195158362009L, 26.116733567402L,  3.204210884008L,
    24.018751268030L, 10.239611235086L, 20.080376776407L, 16.365177192133L,
    14.640657817410L, 21.115886034709L,  8.151062864373L, 24.142998727191L,
     1.137730164495L, 25.239604483528L, -5.841537285874L, 24.354402883940L,
    -12.241987355770L, 21.592840311749L, -17.574731331896L, 17.205753514438L,
    -21.444263989224L, 11.566676729916L, -23.577796404216L,  5.139858771041L,
    -23.844226030109L, -1.558257644704L, -22.261449194246L, -8.000874052075L,
    -18.991687891276L, -13.692574750918L, -14.325474762079L, -18.207633032011L,
    -8.655837993642L, -21.221905193669L, -2.444979924821L, -22.535918498909L,
     3.813708620228L, -22.087525360896L,  9.635151732707L, -19.953375383811L,
    14.580421124700L, -16.339374835126L, 18.289927272099L, -11.561183729348L,
    20.509450684819L, -6.016572978414L, 21.107139358960L, -0.152067765622L,
    20.080376776407L,  5.573306345852L, 17.552269726480L, 10.724207034000L,
    13.758345746956L, 14.922214864769L,  9.024817500802L, 17.873579116189L,
     3.740405317446L, 19.389440415856L, -1.675838333853L, 19.397169295985L,
    -6.808018827424L, 17.942216825708L, -11.275505814220L, 15.180654253518L,
    -14.761162833548L, 11.363318326896L, -17.033606442297L,  6.813118418580L,
    -17.961956087608L,  1.897551852521L, -17.522195000658L, -3.001219972068L,
    -15.794967652696L, -7.516278253161L, -12.955331100281L, -11.323479289073L,
    -9.255599512633L, -14.164542435625L, -5.002924950441L, -15.864065805041L,
    -0.533606442297L, -16.339397860209L,  3.813708620228L, -15.602911523856L,
     7.723778250182L, -13.756854745111L, 10.927508081499L, -10.981535446498L,
    13.220052022653L, -7.518093132961L, 14.473093893824L, -3.647477516570L,
    14.640657817410L,  0.332528033291L, 13.758345746956L,  4.130344018488L,
    11.936429409872L,  7.481900115480L,  9.347688200029L, 10.168656553433L,
     6.211249002453L, 12.031143928646L,  2.773923775897L, 12.977254357624L,
    -0.709356792303L, 12.984983237754L, -3.994450329075L, 12.099781638166L,
    -6.864848267293L, 10.427095942182L, -9.145322516939L,  8.121011408376L,
    -10.711575412847L,  5.370156091216L, -11.495474546058L,  2.382147651435L,
    -11.485838209663L, -0.632124510223L, -10.725092403251L, -3.473187656775L,
    -9.302418057079L, -5.965639900445L, -7.344226030109L, -7.968021796925L,
    -5.002924950441L, -9.379451968001L, -2.444979924822L, -10.142877221509L,
     0.160795577026L, -10.245072135228L,  2.653903000737L, -9.713764148724L,
     4.891151290503L, -8.612439984653L,  6.753570481103L, -7.033497334048L,
     8.151062864373L, -5.090439843934L,  9.024817500802L, -2.909778885229L,
     9.347688200029L, -0.623214292848L,  9.122860911524L,  1.639464927938L,
     8.381206658480L,  3.756470495202L,  7.177730544003L,  5.618957870415L,
     5.587492274245L,  7.134819170082L,  3.701300754623L,  8.231424926419L,
     1.621389987533L,  8.857474719646L, -0.542817237843L,  8.984133614818L,
    -2.678840975389L,  8.605607207290L, -4.675218621851L,  7.739251553061L,
    -6.425599296612L,  6.425238247821L, -7.832925166461L,  4.725714878405L,
    -8.813718920727L,  2.723332981925L, -9.302418057079L,  0.518973936595L,
    -9.255599512633L, -1.771501158225L, -8.655837993642L, -4.021612579373L,
    -7.514855174267L, -6.099786625122L, -5.875561213969L, -7.875976673383L,
    -3.812578540813L, -9.229168349811L, -1.430879738948L, -10.055402312018L,
     1.137730164495L, -10.275804252568L,  3.740405317446L, -9.843998155270L,
     6.211249002453L, -8.752214072771L,  8.381206658480L, -7.035400351079L,
    10.089342453073L, -4.772721130293L, 11.194775156828L, -2.085964692340L,
    11.588388090930L,  0.865399559080L, 11.203332590854L,  3.892512251562L,
    10.023331784074L,  6.788462599054L,  8.087871529083L,  9.342070518560L,
     5.493539553153L, 11.353229076663L,  2.391034274056L, 12.648697803677L,
    -1.022305578650L, 13.097090941689L, -4.514225814088L, 12.621758886521L,
    -7.832925166462L, 11.210328715445L, -10.725092403251L,  8.919853620625L,
    -12.955331100281L,  5.876813325224L, -14.325474762079L,  2.271589438162L,
    -14.692194784638L, -1.652517117528L, -13.981336715817L, -5.615190826209L,
    -12.197592243420L, -9.318939000748L, -9.428418857422L, -12.471475268331L,
    -5.841537285874L, -14.808960623353L, -1.675838333853L, -16.118239440110L,
     2.773923775897L, -16.256184213501L,  7.177730544003L, -15.164400131002L,
    11.194775156828L, -12.877835538621L, 14.500000000000L, -9.526279441629L,
    16.810615473437L, -5.328271610860L, 17.910419120381L, -0.577562768284L,
    17.669814132404L,  4.377108050476L, 16.059688575069L,  9.157558060899L,
    13.157746778529L, 13.385161114947L,  9.146452596354L, 16.711068465291L,
     4.302407756580L, 18.845218442377L, -1.022305578650L, 19.581704778729L,
    -6.425599296612L, 18.818279525221L, -11.485838209663L, 16.568168104073L,
    -15.794967652696L, 12.962944217011L, -18.991687891276L,  8.245908787068L,
    -20.791956303629L,  2.756185237075L, -21.014225814089L, -3.095479444892L,
    -19.597177032426L, -8.857497744729L, -16.608249790347L, -14.072497312083L,
    -12.241987355770L, -18.313910455873L, -6.808018827424L, -21.221146681585L,
    -0.709356792304L, -22.530425498341L,  5.587492274245L, -22.098619401043L,
    11.588388090930L, -19.917958442338L, 16.810615473437L, -16.120142457141L,
    20.822031029451L, -10.969241768993L, 23.277097014987L, -4.843675811946L,
    23.946775911376L,  1.791532693560L, 22.739689381849L,  8.420198646863L,
    19.712601618271L, 14.515397449528L, 15.069120261053L, 19.581681753647L,
     9.146452596354L, 23.195682302331L,  2.391034274056L, 25.041739081076L,
    -4.675218621851L, 24.939544167357L, -11.495474546058L, 22.861370121607L,
    -17.522195000659L, 18.937263565918L, -22.261449194246L, 13.447540015925L,
    -25.313718920727L,  6.802946459704L, -26.407796620237L, -0.486121681445L,
    -25.424883361015L, -7.849037756228L, -22.410745530774L, -14.699932932271L,
    -17.574731331896L, -20.484683370314L, -11.275505814220L, -24.726096514104L,
    -3.994450329075L, -27.063581869127L,  3.701300754623L, -27.283983809676L,
    11.203332590854L, -25.340926319563L, 17.910419120381L, -21.360920769702L,
    23.277097014986L, -15.635546658227L, 26.858387820446L, -8.600146307148L,
    28.346972264432L, -0.800585215559L, 27.599688954577L,  7.149372082189L,
    24.651062864373L, 14.616719285563L, 19.712601618271L, 21.000011286568L,
    13.157746778529L, 25.778202392346L,  5.493539553153L, 28.553521690959L,
    -2.678840975389L, 29.084829677463L, -10.711575412847L, 27.308639629202L,
    -17.961956087608L, 23.345965920521L, -23.844226030109L, 17.494301238554L,
    -27.877289510855L, 10.205233097405L, -29.724376467653L,  2.049388148368L,
    -29.221365118586L, -6.328556868987L, -26.391364902565L, -14.261223814459L,
    -21.444263989224L, -21.112118990502L, -14.761162833548L, -26.327118557857L,
    -6.864848267293L, -29.479654825440L,  1.621389987533L, -30.305888787647L,
    10.023331784074L, -28.726946137041L, 17.669814132403L, -24.856330520649L,
    23.946775911376L, -18.991825307857L, 28.346972264432L, -11.592456061840L,
    30.511300863648L, -3.242306918520L, 30.258345746956L,  5.395935423141L,
    27.599688954577L, 13.633985919229L, 22.739689381849L, 20.813239924262L,
    16.059688575069L, 26.357850675196L,  8.087871529083L, 29.821292988733L,
    -0.542817237843L, 30.922617152804L, -9.145322516939L, 29.569425476376L,
    -17.033606442297L, 25.865677301838L, -23.577796404217L, 20.103659002001L,
    -28.254883577036L, 12.740742927218L, -30.690858009203L,  4.362797909863L,
    -30.690858009203L, -4.362797909863L, -28.254883577036L, -12.740742927218L,
    -23.577796404216L, -20.103659002001L, -17.033606442297L, -25.865677301838L,
    -9.145322516939L, -29.569425476376L, -0.542817237843L, -30.922617152804L,
     8.087871529083L, -29.821292988733L, 16.059688575069L, -26.357850675196L,
    22.739689381849L, -20.813239924262L, 27.599688954577L, -13.633985919229L,
    30.258345746956L, -5.395935423140L, 30.511300863647L,  3.242306918520L,
    28.346972264432L, 11.592456061840L, 23.946775911376L, 18.991825307857L,
    17.669814132403L, 24.856330520649L, 10.023331784074L, 28.726946137040L,
     1.621389987533L, 30.305888787646L, -6.864848267293L, 29.479654825440L,
    -14.761162833548L, 26.327118557856L, -21.444263989224L, 21.112118990502L,
    -26.391364902565L, 14.261223814459L, -29.221365118585L,  6.328556868987L,
    -29.724376467653L, -2.049388148368L, -27.877289510855L, -10.205233097405L,
    -23.844226030109L, -17.494301238554L, -17.961956087608L, -23.345965920521L,
    -10.711575412847L, -27.308639629202L, -2.678840975389L, -29.084829677463L,
     5.493539553153L, -28.553521690959L, 13.157746778529L, -25.778202392346L,
    19.712601618270L, -21.000011286567L, 24.651062864373L, -14.616719285562L,
    27.599688954577L, -7.149372082189L, 28.346972264432L,  0.800585215559L,
    26.858387820446L,  8.600146307148L, 23.277097014986L, 15.635546658227L,
    17.910419120380L, 21.360920769701L, 11.203332590854L, 25.340926319562L,
     3.701300754623L, 27.283983809676L, -3.994450329075L, 27.063581869126L,
    -11.275505814220L, 24.726096514104L, -17.574731331896L, 20.484683370314L,
    -22.410745530774L, 14.699932932271L, -25.424883361015L,  7.849037756228L,
    -26.407796620237L,  0.486121681445L, -25.313718920726L, -6.802946459704L,
    -22.261449194246L, -13.447540015925L, -17.522195000658L, -18.937263565918L,
    -11.495474546058L, -22.861370121607L, -4.675218621851L, -24.939544167357L,
     2.391034274056L, -25.041739081076L,  9.146452596354L, -23.195682302330L,
    15.069120261052L, -19.581681753646L, 19.712601618270L, -14.515397449527L,
    22.739689381849L, -8.420198646863L, 23.946775911376L, -1.791532693560L,
    23.277097014986L,  4.843675811946L, 20.822031029450L, 10.969241768993L,
    16.810615473436L, 16.120142457140L, 11.588388090930L, 19.917958442337L,
     5.587492274245L, 22.098619401042L, -0.709356792303L, 22.530425498340L,
    -6.808018827424L, 21.221146681584L, -12.241987355770L, 18.313910455873L,
    -16.608249790346L, 14.072497312083L, -19.597177032425L,  8.857497744729L,
    -21.014225814088L,  3.095479444892L, -20.791956303628L, -2.756185237075L,
    -18.991687891276L, -8.245908787068L, -15.794967652696L, -12.962944217011L,
    -11.485838209663L, -16.568168104073L, -6.425599296612L, -18.818279525220L,
    -1.022305578650L, -19.581704778728L,  4.302407756580L, -18.845218442376L,
     9.146452596354L, -16.711068465291L, 13.157746778528L, -13.385161114946L,
    16.059688575069L, -9.157558060899L, 17.669814132403L, -4.377108050476L,
    17.910419120380L,  0.577562768284L, 16.810615473436L,  5.328271610859L,
    14.500000000000L,  9.526279441628L, 11.194775156828L, 12.877835538620L,
     7.177730544003L, 15.164400131001L,  2.773923775897L, 16.256184213500L,
    -1.675838333853L, 16.118239440109L, -5.841537285874L, 14.808960623353L,
    -9.428418857421L, 12.471475268330L, -12.197592243419L,  9.318939000748L,
    -13.981336715816L,  5.615190826209L, -14.692194784637L,  1.652517117528L,
    -14.325474762078L, -2.271589438161L, -12.955331100280L, -5.876813325223L,
    -10.725092403251L, -8.919853620624L, -7.832925166462L, -11.210328715444L,
    -4.514225814089L, -12.621758886521L, -1.022305578650L, -13.097090941688L,
     2.391034274056L, -12.648697803676L,  5.493539553152L, -11.353229076662L,
     8.087871529082L, -9.342070518560L, 10.023331784073L, -6.788462599055L,
    11.203332590853L, -3.892512251563L, 11.588388090929L, -0.865399559080L,
    11.194775156828L,  2.085964692339L, 10.089342453073L,  4.772721130293L,
     8.381206658480L,  7.035400351078L,  6.211249002454L,  8.752214072770L,
     3.740405317447L,  9.843998155269L,  1.137730164495L, 10.275804252567L,
    -1.430879738947L, 10.055402312017L, -3.812578540812L,  9.229168349811L,
    -5.875561213969L,  7.875976673384L, -7.514855174266L,  6.099786625123L,
    -8.655837993642L,  4.021612579373L, -9.255599512633L,  1.771501158225L,
    -9.302418057079L, -0.518973936594L, -8.813718920727L, -2.723332981924L,
    -7.832925166462L, -4.725714878404L, -6.425599296613L, -6.425238247821L,
    -4.675218621852L, -7.739251553060L, -2.678840975390L, -8.605607207290L,
    -0.542817237843L, -8.984133614818L,  1.621389987533L, -8.857474719647L,
     3.701300754623L, -8.231424926419L,  5.587492274245L, -7.134819170083L,
     7.177730544003L, -5.618957870416L,  8.381206658479L, -3.756470495203L,
     9.122860911524L, -1.639464927939L,  9.347688200030L,  0.623214292847L,
     9.024817500802L,  2.909778885228L,  8.151062864374L,  5.090439843933L,
     6.753570481104L,  7.033497334047L,  4.891151290504L,  8.612439984653L,
     2.653903000738L,  9.713764148725L,  0.160795577027L, 10.245072135228L,
    -2.444979924821L, 10.142877221509L, -5.002924950441L,  9.379451968002L,
    -7.344226030109L,  7.968021796925L, -9.302418057079L,  5.965639900445L,
    -10.725092403251L,  3.473187656775L, -11.485838209663L,  0.632124510224L,
    -11.495474546059L, -2.382147651434L, -10.711575412847L, -5.370156091216L,
    -9.145322516940L, -8.121011408376L, -6.864848267294L, -10.427095942182L,
    -3.994450329076L, -12.099781638167L, -0.709356792304L, -12.984983237755L,
     2.773923775896L, -12.977254357625L,  6.211249002453L, -12.031143928647L,
     9.347688200029L, -10.168656553434L, 11.936429409872L, -7.481900115481L,
    13.758345746956L, -4.130344018489L, 14.640657817411L, -0.332528033292L,
    14.473093893824L,  3.647477516569L, 13.220052022654L,  7.518093132961L,
    10.927508081499L, 10.981535446498L,  7.723778250183L, 13.756854745111L,
     3.813708620228L, 15.602911523857L, -0.533606442297L, 16.339397860209L,
    -5.002924950441L, 15.864065805042L, -9.255599512633L, 14.164542435625L,
    -12.955331100281L, 11.323479289074L, -15.794967652697L,  7.516278253162L,
    -17.522195000659L,  3.001219972068L, -17.961956087608L, -1.897551852521L,
    -17.033606442298L, -6.813118418580L, -14.761162833548L, -11.363318326896L,
    -11.275505814221L, -15.180654253518L, -6.808018827424L, -17.942216825709L,
    -1.675838333854L, -19.397169295986L,  3.740405317446L, -19.389440415856L,
     9.024817500802L, -17.873579116189L, 13.758345746956L, -14.922214864770L,
    17.552269726481L, -10.724207034000L, 20.080376776407L, -5.573306345853L,
    21.107139358961L,  0.152067765622L, 20.509450684820L,  6.016572978414L,
    18.289927272099L, 11.561183729348L, 14.580421124701L, 16.339374835127L,
     9.635151732707L, 19.953375383811L,  3.813708620228L, 22.087525360897L,
    -2.444979924821L, 22.535918498909L, -8.655837993642L, 21.221905193670L,
    -14.325474762079L, 18.207633032012L, -18.991687891276L, 13.692574750918L,
    -22.261449194247L,  8.000874052075L, -23.844226030110L,  1.558257644704L,
    -23.577796404217L, -5.139858771041L, -21.444263989224L, -11.566676729916L,
    -17.574731331897L, -17.205753514439L, -12.241987355770L, -21.592840311749L,
    -5.841537285874L, -24.354402883940L,  1.137730164495L, -25.239604483528L,
     8.151062864373L, -24.142998727192L, 14.640657817411L, -21.115886034709L,
    20.080376776407L, -16.365177192134L, 24.018751268031L, -10.239611235086L,
    26.116733567402L, -3.204210884008L, 26.177014608406L,  4.195158362009L,
    24.162363728021L, 11.374412367043L, 20.201300754623L, 17.757704368048L,
    14.580421124700L, 22.823988672167L,  7.723778250183L, 26.149896022511L,
     0.160795577026L, 27.445364749525L, -7.514855174267L, 26.579009095295L,
    -14.692194784638L, 23.591000655514L, -20.791956303629L, 18.692228830925L,
    -25.313718920727L, 12.249612423554L, -27.877289510855L,  4.758567133555L,
    -28.254883577036L, -3.195300666632L, -26.391364902565L, -10.982293958583L,
    -22.410745530774L, -17.978862788147L, -16.608249790346L, -23.617939572670L,
    -9.428418857422L, -27.435275499291L, -1.430879738947L, -29.107961195276L,
     6.753570481104L, -28.481911402048L, 14.473093893824L, -25.585961054556L,
    21.107139358960L, -20.631290235795L, 26.116733567402L, -13.996081730289L,
    29.088626517476L, -6.196520638700L, 29.769646610604L,  2.153628504621L,
    28.088388090930L, 10.391679000709L, 24.162363728021L, 17.859026204083L,
    18.289927272099L, 23.954225006748L, 10.927508081499L, 28.181828060795L,
     2.653903000737L, 30.192986618897L, -5.875561213969L, 29.814460211370L,
    -13.981336715817L, 27.063604894209L, -21.014225814089L, 22.148038328150L,
    -26.407796620237L, 15.449921912405L, -29.724376467653L,  7.496054112218L,
    -30.690858009203L, -1.083868053987L, -29.221365118586L, -9.607486724863L,
    -25.424883361015L, -17.394480016814L, -19.597177032425L, -23.821297975689L,
    -12.197592243420L, -28.371497884005L, -3.812578540813L, -30.677582417811L,
     4.891151290503L, -30.550923522639L, 13.220052022653L, -27.997315603134L,
    20.509450684819L, -23.216865592711L, 26.177014608406L, -16.588199639408L,
    29.769646610604L, -8.638242341660L, 31.000000000000L,  0.000000000000L,
    29.769646610604L,  8.638242341661L, 26.177014608406L, 16.588199639409L,
    20.509450684819L, 23.216865592711L, 13.220052022653L, 27.997315603134L,
     4.891151290503L, 30.550923522639L, -3.812578540813L, 30.677582417811L,
    -12.197592243420L, 28.371497884005L, -19.597177032425L, 23.821297975689L,
    -25.424883361015L, 17.394480016814L, -29.221365118585L,  9.607486724863L,
    -30.690858009203L,  1.083868053987L, -29.724376467653L, -7.496054112218L,
    -26.407796620237L, -15.449921912405L, -21.014225814088L, -22.148038328150L,
    -13.981336715817L, -27.063604894209L, -5.875561213969L, -29.814460211369L,
     2.653903000737L, -30.192986618897L, 10.927508081499L, -28.181828060795L,
    18.289927272099L, -23.954225006747L, 24.162363728020L, -17.859026204082L,
    28.088388090930L, -10.391679000709L, 29.769646610603L, -2.153628504620L,
    29.088626517476L,  6.196520638700L, 26.116733567402L, 13.996081730289L,
    21.107139358960L, 20.631290235795L, 14.473093893824L, 25.585961054555L,
     6.753570481103L, 28.481911402047L, -1.430879738947L, 29.107961195275L,
};

