TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/dsp/dsp_fpu_fft_fpu64_f2838x.c
const float64_t test_golden[2048] = {
    117.619584943462L, 127.242033175182L, 122.152715752133L, 133.687099634118L,
    127.120532885294L, 140.738781568502L, 132.589267225241L, 148.487804903146L,
    138.639351712989L, 157.043990157556L, 145.369451897035L, 166.541571131583L,
    152.901954792613L, 177.146402471586L, 161.390572562403L, 189.065890930191L,
    171.031079335451L, 202.562936929641L, 182.076802762112L, 217.975921074026L,
    194.861530540112L, 235.748048327442L, 209.834346665073L, 256.471625868494L,
    227.614365086097L, 280.957027188816L, 249.080078287504L, 310.344180780178L,
    275.522012629059L, 346.290987314120L, 308.918374109699L, 391.309393734066L,
    352.468137771088L, 449.406424011788L, 411.716548644928L, 527.416619098102L,
    497.225186173212L, 638.108021871189L, 632.033708613183L, 808.694263606146L,
    878.469654713117L, 1110.778971519350L, 1490.034930848489L, 1826.421831229780L,
    6509.054287883688L, 7312.371922633241L, -1738.099865227832L, -1244.246461125538L,
    685.737268288577L, 3063.037015212825L, -1558.192774163421L, -3158.638164269519L,
    -791.110574975655L, -1438.688477457563L, -555.545775080599L, -974.053939551695L,
    -431.414209454572L, -746.111402200683L, -352.875108348188L, -608.128626224547L,
    -298.181549489710L, -514.854617875921L, -257.720390452005L, -447.304740657774L,
    -226.499162968640L, -396.004915948199L, -201.640992361091L, -355.662278582961L,
    -181.361753398661L, -323.074055362930L, -164.492370897649L, -296.182869784439L,
    -150.233103890763L, -273.604144280813L, -138.017555117918L, -254.370601080814L,
    -127.432936739502L, -237.785411348240L, -118.171079420787L, -223.333493743650L,
    -109.997138343705L, -210.625685143494L, -102.728936307431L, -199.362359701892L,
    -96.222938943556L, -189.309006234690L, -90.364497167049L, -180.279405702513L,
    -85.060911417360L, -172.123779647563L, -80.236407258215L, -164.720272892233L,
    -75.828433523534L, -157.968723093854L, -71.784893158676L, -151.786030251529L,
    -68.062043165326L, -146.102665725603L, -64.622882029699L, -140.860006007058L,
    -61.435897336733L, -136.008272204096L, -58.474082949829L, -131.504920348102L,
    -55.714160322112L, -127.313371350652L, -53.135956071054L, -123.401999742202L,
    -50.721900375484L, -119.743321628209L, -48.456619661756L, -116.313337484126L,
    -46.326603509118L, -113.090996371375L, -44.319930447030L, -110.057756160060L,
    -42.426040834142L, -107.197220252240L, -40.635547642280L, -104.494835704852L,
    -38.940077959112L, -101.937640967313L, -37.332139540330L, -99.514053966867L,
    -35.805007908011L, -97.213693202878L, -34.352630394507L, -95.027225999173L,
    -32.969544235194L, -92.946239220284L, -31.650806366156L, -90.963128662933L,
    -30.391933019651L, -89.071004047590L, -29.188847557445L, -87.263607100709L,
    -28.037835259780L, -85.535240669414L, -26.935504010991L, -83.880707172353L,
    -25.878750003170L, -82.295254982207L, -24.864727725900L, -80.774531571890L,
    -23.890823629616L, -79.314542449056L, -22.954632948230L, -77.911615061087L,
    -22.053939247378L, -76.562366982289L, -21.186696331392L, -75.263677801814L,
    -20.351012197482L, -74.012664219431L, -19.545134771809L, -72.806657929897L,
    -18.767439200691L, -71.643185938172L, -18.016416502615L, -70.519952999267L,
    -17.290663413982L, -69.434825919814L, -16.588873284559L, -68.385819495012L,
    -15.909827898165L, -67.371083885511L, -15.252390110662L, -66.388893265060L,
    -14.615497211535L, -65.437635592088L, -13.998154927385L, -64.515803377467L,
    -13.399431996058L, -63.621985337037L, -12.818455249027L, -62.754858831501L,
    -12.254405147329L, -61.913183008369L, -11.706511722971L, -61.095792571014L,
    -11.174050883478L, -60.301592108939L, -10.656341042221L, -59.529550931137L,
    -10.152740041495L, -58.778698351204L, -9.662642339095L, -58.048119378785L,
    -9.185476432426L, -57.336950777048L, -8.720702497072L, -56.644377450427L,
    -8.267810219270L, -55.969629130778L, -7.826316803966L, -55.311977333578L,
    -7.395765142075L, -54.670732558831L, -6.975722122286L, -54.045241714022L,
    -6.565777074295L, -53.434885738846L, -6.165540331665L, -52.839077413495L,
    -5.774641903733L, -52.257259334179L, -5.392730247025L, -51.688902041160L,
    -5.019471127584L, -51.133502286079L, -4.654546566463L, -50.590581426601L,
    -4.297653861367L, -50.059683937628L, -3.948504678108L, -49.540376029287L,
    -3.606824206130L, -49.032244362886L, -3.272350372886L, -48.534894856817L,
    -2.944833112339L, -48.047951575144L, -2.624033683298L, -47.571055692269L,
    -2.309724033641L, -47.103864527660L, -2.001686206899L, -46.646050645192L,
    -1.699711787910L, -46.197301012076L, -1.403601384594L, -45.757316212862L,
    -1.113164143124L, -45.325809714323L, -0.828217294014L, -44.902507177437L,
    -0.548585726837L, -44.487145812971L, -0.274101591498L, -44.079473777481L,
    -0.004603924144L, -43.679249606805L,  0.260061704052L, -43.286241684349L,
     0.520043516843L, -42.900227741708L,  0.775483843086L, -42.520994389346L,
     1.026519408515L, -42.148336675243L,  1.273281610371L, -41.782057669586L,
     1.515896776056L, -41.421968073726L,  1.754486406879L, -41.067885851763L,
     1.989167407892L, -40.719635883247L,  2.220052304735L, -40.377049635584L,
     2.447249448334L, -40.039964854881L,  2.670863208244L, -39.708225273994L,
     2.890994155363L, -39.381680336704L,  3.107739234691L, -39.060184936971L,
     3.321191928767L, -38.743599172318L,  3.531442412364L, -38.431788110463L,
     3.738577698974L, -38.124621568367L,  3.942681779604L, -37.821973902943L,
     4.143835754338L, -37.523723812708L,  4.342117957105L, -37.229754149713L,
     4.537604074057L, -36.939951741145L,  4.730367255940L, -36.654207220012L,
     4.920478224811L, -36.372414864385L,  5.108005375425L, -36.094472444691L,
     5.293014871602L, -35.820281078597L,  5.475570737874L, -35.549745093031L,
     5.655734946654L, -35.282771892960L,  5.833567501214L, -35.019271836514L,
     6.009126514672L, -34.759158116118L,  6.182468285238L, -34.502346645292L,
     6.353647367905L, -34.248755950803L,  6.522716642796L, -33.998307069879L,
     6.689727380328L, -33.750923452206L,  6.854729303391L, -33.506530866457L,
     7.017770646671L, -33.265057311099L,  7.178898213302L, -33.026432929258L,
     7.338157428951L, -32.790589927429L,  7.495592393501L, -32.557462497824L,
     7.651245930444L, -32.326986744168L,  7.805159634096L, -32.099100610777L,
     7.957373914756L, -31.873743814733L,  8.107928041909L, -31.650857781008L,
     8.256860185566L, -31.430385580391L,  8.404207455850L, -31.212271870070L,
     8.550005940897L, -30.996462836733L,  8.694290743158L, -30.782906142083L,
     8.837096014201L, -30.571550870623L,  8.978454988054L, -30.362347479622L,
     9.118400013183L, -30.155247751140L,  9.256962583165L, -29.950204746020L,
     9.394173366110L, -29.747172759762L,  9.530062232906L, -29.546107280168L,
     9.664658284321L, -29.346964946690L,  9.797989877045L, -29.149703511409L,
     9.930084648690L, -28.954281801538L, 10.060969541818L, -28.760659683420L,
    10.190670827035L, -28.568798027913L, 10.319214125188L, -28.378658677126L,
    10.446624428711L, -28.190204412433L, 10.572926122165L, -28.003398923710L,
    10.698143001992L, -27.818206779739L, 10.822298295527L, -27.634593399723L,
    10.945414679310L, -27.452525025879L, 11.067514296705L, -27.271968697036L,
    11.188618774884L, -27.092892223218L, 11.308749241180L, -26.915264161154L,
    11.427926338852L, -26.739053790683L, 11.546170242277L, -26.564231092011L,
    11.663500671604L, -26.390766723781L, 11.779936906879L, -26.218632001934L,
    11.895497801679L, -26.047798879313L, 12.010201796259L, -25.878239925985L,
    12.124066930251L, -25.709928310252L, 12.237110854915L, -25.542837780322L,
    12.349350844972L, -25.376942646606L, 12.460803810033L, -25.212217764634L,
    12.571486305645L, -25.048638518533L, 12.681414543959L, -24.886180805080L,
    12.790604404040L, -24.724821018277L, 12.899071441849L, -24.564536034449L,
    13.006830899876L, -24.405303197823L, 13.113897716475L, -24.247100306594L,
    13.220286534887L, -24.089905599431L, 13.326011711974L, -23.933697742429L,
    13.431087326676L, -23.778455816475L, 13.535527188197L, -23.624159305018L,
    13.639344843931L, -23.470788082226L, 13.742553587149L, -23.318322401509L,
    13.845166464434L, -23.166742884414L, 13.947196282900L, -23.016030509841L,
    14.048655617183L, -22.866166603613L, 14.149556816219L, -22.717132828344L,
    14.249912009826L, -22.568911173626L, 14.349733115083L, -22.421483946499L,
    14.449031842520L, -22.274833762216L, 14.547819702133L, -22.128943535266L,
    14.646108009215L, -21.983796470672L, 14.743907890030L, -21.839376055528L,
    14.841230287311L, -21.695666050792L, 14.938085965619L, -21.552650483298L,
    15.034485516537L, -21.410313638007L, 15.130439363727L, -21.268640050462L,
    15.225957767849L, -21.127614499460L, 15.321050831340L, -20.987221999919L,
    15.415728503074L, -20.847447795940L, 15.510000582883L, -20.708277354055L,
    15.603876725975L, -20.569696356657L, 15.697366447226L, -20.431690695594L,
    15.790479125363L, -20.294246465939L, 15.883224007043L, -20.157349959915L,
    15.975610210828L, -20.020987660971L, 16.067646731057L, -19.885146238013L,
    16.159342441631L, -19.749812539773L, 16.250706099699L, -19.614973589319L,
    16.341746349255L, -19.480616578692L, 16.432471724658L, -19.346728863676L,
    16.522890654062L, -19.213297958689L, 16.613011462770L, -19.080311531790L,
    16.702842376513L, -18.947757399803L, 16.792391524654L, -18.815623523547L,
    16.881666943323L, -18.683898003175L, 16.970676578485L, -18.552569073610L,
    17.059428288944L, -18.421625100080L, 17.147929849280L, -18.291054573752L,
    17.236188952728L, -18.160846107442L, 17.324213214005L, -18.030988431431L,
    17.412010172074L, -17.901470389343L, 17.499587292858L, -17.772280934120L,
    17.586951971904L, -17.643409124062L, 17.674111536994L, -17.514844118949L,
    17.761073250719L, -17.386575176223L, 17.847844312993L, -17.258591647247L,
    17.934431863539L, -17.130882973625L, 18.020842984326L, -17.003438683581L,
    18.107084701966L, -16.876248388399L, 18.193163990078L, -16.749301778922L,
    18.279087771614L, -16.622588622097L, 18.364862921151L, -16.496098757582L,
    18.450496267152L, -16.369822094393L, 18.535994594192L, -16.243748607597L,
    18.621364645163L, -16.117868335057L, 18.706613123441L, -15.992171374211L,
    18.791746695037L, -15.866647878894L, 18.876771990717L, -15.741288056193L,
    18.961695608098L, -15.616082163345L, 19.046524113732L, -15.491020504658L,
    19.131264045155L, -15.366093428471L, 19.215921912929L, -15.241291324138L,
    19.300504202663L, -15.116604619039L, 19.385017377016L, -14.992023775620L,
    19.469467877684L, -14.867539288446L, 19.553862127379L, -14.743141681290L,
    19.638206531792L, -14.618821504224L, 19.722507481544L, -14.494569330739L,
    19.806771354131L, -14.370375754874L, 19.891004515856L, -14.246231388364L,
    19.975213323759L, -14.122126857791L, 20.059404127534L, -13.998052801751L,
    20.143583271453L, -13.873999868028L, 20.227757096269L, -13.749958710769L,
    20.311931941137L, -13.625919987673L, 20.396114145518L, -13.501874357169L,
    20.480310051087L, -13.377812475607L, 20.564526003653L, -13.253724994440L,
    20.648768355064L, -13.129602557405L, 20.733043465129L, -13.005435797697L,
    20.817357703544L, -12.881215335145L, 20.901717451815L, -12.756931773363L,
    20.986129105199L, -12.632575696911L, 21.070599074649L, -12.508137668425L,
    21.155133788772L, -12.383608225744L, 21.239739695791L, -12.258977879019L,
    21.324423265532L, -12.134237107801L, 21.409190991412L, -12.009376358114L,
    21.494049392450L, -11.884386039501L, 21.579005015296L, -11.759256522051L,
    21.664064436269L, -11.633978133397L, 21.749234263425L, -11.508541155691L,
    21.834521138639L, -11.382935822542L, 21.919931739711L, -11.257152315928L,
    22.005472782496L, -11.131180763073L, 22.091151023056L, -11.005011233289L,
    22.176973259847L, -10.878633734774L, 22.262946335923L, -10.752038211378L,
    22.349077141176L, -10.625214539321L, 22.435372614607L, -10.498152523865L,
    22.521839746631L, -10.370841895945L, 22.608485581409L, -10.243272308743L,
    22.695317219227L, -10.115433334210L, 22.782341818906L, -9.987314459544L,
    22.869566600251L, -9.858905083592L, 22.956998846550L, -9.730194513210L,
    23.044645907105L, -9.601171959549L, 23.132515199816L, -9.471826534276L,
    23.220614213812L, -9.342147245731L, 23.308950512128L, -9.212122995011L,
    23.397531734439L, -9.081742571977L, 23.486365599838L, -8.950994651182L,
    23.575459909686L, -8.819867787721L, 23.664822550503L, -8.688350412999L,
    23.754461496930L, -8.556430830401L, 23.844384814756L, -8.424097210883L,
    23.934600664000L, -8.291337588455L, 24.025117302073L, -8.158139855576L,
    24.115943087006L, -8.024491758440L, 24.207086480749L, -7.890380892155L,
    24.298556052554L, -7.755794695809L, 24.390360482431L, -7.620720447428L,
    24.482508564690L, -7.485145258807L, 24.575009211571L, -7.349056070211L,
    24.667871456960L, -7.212439644963L, 24.761104460199L, -7.075282563878L,
    24.854717509992L, -6.937571219572L, 24.948720028417L, -6.799291810616L,
    25.043121575031L, -6.660430335540L, 25.137931851092L, -6.520972586690L,
    25.233160703893L, -6.380904143909L, 25.328818131205L, -6.240210368055L,
    25.424914285852L, -6.098876394345L, 25.521459480399L, -5.956887125515L,
    25.618464191985L, -5.814227224788L, 25.715939067277L, -5.670881108650L,
    25.813894927577L, -5.526832939422L, 25.912342774064L, -5.382066617610L,
    26.011293793201L, -5.236565774052L, 26.110759362285L, -5.090313761820L,
    26.210751055173L, -4.943293647895L, 26.311280648172L, -4.795488204587L,
    26.412360126106L, -4.646879900708L, 26.514001688573L, -4.497450892468L,
    26.616217756379L, -4.347183014104L, 26.719020978191L, -4.196057768210L,
    26.822424237375L, -4.044056315780L, 26.926440659067L, -3.891159465930L,
    27.031083617452L, -3.737347665302L, 27.136366743287L, -3.582600987129L,
    27.242303931659L, -3.426899119948L, 27.348909349994L, -3.270221355959L,
    27.456197446331L, -3.112546578989L, 27.564182957863L, -2.953853252079L,
    27.672880919767L, -2.794119404647L, 27.782306674324L, -2.633322619233L,
    27.892475880347L, -2.471440017795L, 28.003404522927L, -2.308448247544L,
    28.115108923518L, -2.144323466296L, 28.227605750358L, -1.979041327322L,
    28.340912029264L, -1.812576963676L, 28.455045154790L, -1.644904971974L,
    28.570022901791L, -1.475999395610L, 28.685863437384L, -1.305833707373L,
    28.802585333345L, -1.134380791452L, 28.920207578947L, -0.961612924794L,
    29.038749594260L, -0.787501757787L, 29.158231243945L, -0.612018294243L,
    29.278672851543L, -0.435132870652L, 29.400095214300L, -0.256815134665L,
    29.522519618540L, -0.077034022780L, 29.645967855618L,  0.104242262798L,
    29.770462238471L,  0.287046278187L, 29.896025618803L,  0.471411362745L,
    30.022681404924L,  0.657371664963L, 30.150453580283L,  0.844962169334L,
    30.279366722714L,  1.034218724277L, 30.409446024440L,  1.225178071144L,
    30.540717312869L,  1.417877874367L, 30.673207072204L,  1.612356752802L,
    30.806942465930L,  1.808654312320L, 30.941951360198L,  2.006811179706L,
    31.078262348165L,  2.206869037936L, 31.215904775318L,  2.408870662879L,
    31.354908765856L,  2.612859961519L, 31.495305250149L,  2.818882011746L,
    31.637125993358L,  3.026983103814L, 31.780403625252L,  3.237210783531L,
    31.925171671290L,  3.449613897277L, 32.071464585032L,  3.664242638939L,
    32.219317781944L,  3.881148598861L, 32.368767674671L,  4.100384814908L,
    32.519851709845L,  4.322005825753L, 32.672608406519L,  4.546067726504L,
    32.827077396304L,  4.772628226790L, 32.983299465297L,  5.001746711436L,
    33.141316597903L,  5.233484303858L, 33.301172022639L,  5.467903932332L,
    33.462910260041L,  5.705070399283L, 33.626577172774L,  5.945050453753L,
    33.792220018071L,  6.187912867236L, 33.959887502634L,  6.433728513047L,
    34.129629840122L,  6.682570449423L, 34.301498811374L,  6.934514006577L,
    34.475547827530L,  7.189636877909L, 34.651831996196L,  7.448019215614L,
    34.830408190842L,  7.709743730941L, 35.011335123619L,  7.974895799371L,
    35.194673421772L,  8.243563570981L, 35.380485707891L,  8.515838086326L,
    35.568836684205L,  8.791813398132L, 35.759793221156L,  9.071586699170L,
    35.953424450534L,  9.355258456658L, 36.149801863420L,  9.642932553609L,
    36.348999413250L,  9.934716437518L, 36.551093624307L, 10.230721276869L,
    36.756163705976L, 10.531062125921L, 36.964291673135L, 10.835858098300L,
    37.175562473052L, 11.145232549957L, 37.390064119219L, 11.459313272072L,
    37.607887832556L, 11.778232694559L, 37.829128190481L, 12.102128100848L,
    38.053883284338L, 12.431141854673L, 38.282254885762L, 12.765421639684L,
    38.514348622553L, 13.105120712706L, 38.750274164728L, 13.450398171578L,
    38.990145421414L, 13.801419238569L, 39.234080749354L, 14.158355560410L,
    39.482203173817L, 14.521385526133L, 39.734640622790L, 14.890694603914L,
    39.991526175383L, 15.266475698308L, 40.252998325486L, 15.648929529290L,
    40.519201261752L, 16.038265034707L, 40.790285165127L, 16.434699797815L,
    41.066406525204L, 16.838460501765L, 41.347728476816L, 17.249783413048L,
    41.634421158392L, 17.668914896040L, 41.926662093737L, 18.096111961058L,
    42.224636599041L, 18.531642848451L, 42.528538217087L, 18.975787651569L,
    42.838569180804L, 19.428838981624L, 43.154940908496L, 19.891102677796L,
    43.477874533315L, 20.362898566199L, 43.807601469773L, 20.844561271696L,
    44.144364020331L, 21.336441086885L, 44.488416025449L, 21.838904903031L,
    44.840023560743L, 22.352337208146L, 45.199465685291L, 22.877141157941L,
    45.567035245535L, 23.413739725945L, 45.943039739637L, 23.962576939685L,
    46.327802247679L, 24.524119210559L, 46.721662433626L, 25.098856765784L,
    47.124977625594L, 25.687305191672L, 47.538123981679L, 26.290007098495L,
    47.961497749325L, 26.907533918226L, 48.395516627141L, 27.540487847741L,
    48.840621239010L, 28.189503951372L, 49.297276731441L, 28.855252438287L,
    49.765974506372L, 29.538441131899L, 50.247234103002L, 30.239818150466L,
    50.741605243847L, 30.960174820258L, 51.249670061959L, 31.700348845198L,
    51.772045528347L, 32.461227759711L, 52.309386100879L, 33.243752694745L,
    52.862386618639L, 34.048922490652L, 53.431785468677L, 34.877798194760L,
    54.018368055569L, 35.731507986312L, 54.622970608078L, 36.611252576912L,
    55.246484361821L, 37.518311140949L, 55.889860161962L, 38.454047837690L,
    56.554113536010L, 39.419918995107L, 57.240330293730L, 40.417481035134L,
    57.949672719187L, 41.448399231236L, 58.683386429324L, 42.514457402100L,
    59.442807984318L, 43.617568660375L, 60.229373347672L, 44.759787352938L,
    61.044627308862L, 45.943322349750L, 61.890233998815L, 47.170551862493L,
    62.767988649048L, 48.444040002541L, 63.679830769575L, 49.766555321304L,
    64.627858949458L, 51.141091615607L, 65.614347518056L, 52.570891327791L,
    66.641765345831L, 54.059471926279L, 67.712797112377L, 55.610655719330L,
    68.830367428006L, 57.228603635064L, 69.997668265952L, 58.917853597703L,
    71.218190247920L, 60.683364246930L, 72.495758429905L, 62.530564889481L,
    73.834573362366L, 64.465412745308L, 75.239258354982L, 66.494458762949L,
    76.714914068620L, 68.624923539994L, 78.267181795564L, 70.864785207583L,
    79.902317086033L, 73.222881539633L, 81.627275750945L, 75.709029049563L,
    83.449814739476L, 78.334162468592L, 85.378610983889L, 81.110498798185L,
    87.423402061870L, 84.051731145619L, 89.595153499953L, 87.173258854225L,
    91.906258801066L, 90.492462121130L, 94.370779921298L, 94.029031481689L,
    97.004738079659L, 97.805365406182L, 99.826467646897L, 101.847053044066L,
    102.857049690160L, 106.183464207754L, 106.120846928019L, 110.848475500559L,
    109.646168923228L, 115.881370768319L, 113.466106112823L, 121.327966822696L,
    173.276951060510L, 181.089830123627L, 189.649768042114L, 199.069188947665L,
    209.484330411619L, 221.061919967733L, 234.008238504604L, 248.581632517866L,
    265.110115831537L, 284.016661962186L, 305.856434254100L, 331.373124915083L,
    361.586988593788L, 397.937678467155L, 442.526640258138L, 498.551505350353L,
    571.139144243223L, 669.088040940028L, 808.959043055547L, 1026.378595262401L,
    1416.170490379378L, 2357.121295296745L, 9789.717608671457L, 2137.554770649966L,
    3138.858288882086L, 3522.067542543018L, 1641.852757407762L, 1121.343919306686L,
    861.858714995203L, 703.094067764407L, 594.968498329319L, 516.237668782173L,
    456.203643432004L, 408.845626376496L, 370.498219758862L, 338.794971092069L,
    312.136529858792L, 289.401534575997L, 269.779641960074L, 252.670246446270L,
    237.618496093992L, 224.273459911695L, 212.359962847287L, 201.659134354744L,
    191.994672247213L, 183.222949849079L, 175.225765247397L, 167.904942944872L,
    161.178257379728L, 154.976314881122L, 149.240140677745L, 143.919291453871L,
    138.970364412946L, 134.355808835939L, 130.042970791417L, 126.003319264773L,
    122.211814702840L, 118.646390277230L, 115.287523048539L, 112.117877348673L,
    109.122006568073L, 106.286102476190L, 103.597783458122L, 101.045914791838L,
    98.620455445464L, 96.312326935742L, 94.113300625983L, 92.015900506155L,
    90.013319027959L, 88.099343993359L, 86.268294838330L, 84.514966932144L,
    82.834582739364L, 81.222748877485L, 79.675418255932L, 78.188856608176L,
    76.759612833315L, 75.384492650473L, 74.060535142025L, 72.784991822590L,
    71.555307921988L, 70.369105613583L, 69.224168956065L, 68.118430347795L,
    67.049958319326L, 66.016946512324L, 65.017703712474L, 64.050644820586L,
    63.114282660446L, 62.207220534279L, 61.328145447416L, 60.475821932992L,
    59.649086415569L, 58.846842059595L, 58.068054054706L, 57.311745295261L,
    56.576992416164L, 55.862922151158L, 55.168707983384L, 54.493567061208L,
    53.836757355109L, 53.197575033931L, 52.575352041008L, 51.969453852603L,
    51.379277402870L, 50.804249161078L, 50.243823348222L, 49.697480281361L,
    49.164724835147L, 48.645085010977L, 48.138110605080L, 47.643371967652L,
    47.160458845857L, 46.688979304164L, 46.228558716039L, 45.778838821563L,
    45.339476845996L, 44.910144674738L, 44.490528080528L, 44.080325999045L,
    43.679249849438L, 43.287022896542L, 42.903379651839L, 42.528065310448L,
    42.160835221633L, 41.801454390534L, 41.449697008982L, 41.105346013449L,
    40.768192668314L, 40.438036172769L, 40.114683289819L, 39.797947995938L,
    39.487651150058L, 39.183620180647L, 38.885688789746L, 38.593696672894L,
    38.307489253962L, 38.026917433972L, 37.751837353052L, 37.482110164737L,
    37.217601821867L, 36.958182873400L, 36.703728271495L, 36.454117188268L,
    36.209232841648L, 35.968962329833L, 35.733196473832L, 35.501829667651L,
    35.274759735690L, 35.051887796949L, 34.833118135668L, 34.618358078048L,
    34.407517874729L, 34.200510588698L, 33.997251988359L, 33.797660445477L,
    33.601656837735L, 33.409164455681L, 33.220108913816L, 33.034418065626L,
    32.852021922348L, 32.672852575286L, 32.496844121484L, 32.323932592618L,
    32.154055886907L, 31.987153703930L, 31.823167482187L, 31.662040339274L,
    31.503717014553L, 31.348143814182L, 31.195268558416L, 31.045040531045L,
    30.897410430892L, 30.752330325257L, 30.609753605233L, 30.469634942790L,
    30.331930249568L, 30.196596637275L, 30.063592379642L, 29.932876875857L,
    29.804410615400L, 29.678155144237L, 29.554073032301L, 29.432127842205L,
    29.312284099138L, 29.194507261891L, 29.078763694959L, 28.965020641688L,
    28.853246198401L, 28.743409289486L, 28.635479643388L, 28.529427769476L,
    28.425224935742L, 28.322843147313L, 28.222255125722L, 28.123434288925L,
    28.026354732023L, 27.930991208671L, 27.837319113135L, 27.745314462980L,
    27.654953882364L, 27.566214585905L, 27.479074363122L, 27.393511563390L,
    27.309505081434L, 27.227034343301L, 27.146079292826L, 27.066620378547L,
