TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/dsp/dsp_fpu_fft_fpu64_f2838x.c
    26.988638541068L, 26.912115200848L, 26.837032246401L, 26.763372022898L,
    26.691117321139L, 26.620251366905L, 26.550757810664L, 26.482620717610L,
    26.415824558047L, 26.350354198083L, 26.286194890635L, 26.223332266732L,
    26.161752327105L, 26.101441434058L, 26.042386303604L, 25.984573997863L,
    25.927991917711L, 25.872627795674L, 25.818469689052L, 25.765505973276L,
    25.713725335486L, 25.663116768319L, 25.613669563908L, 25.565373308074L,
    25.518217874728L, 25.472193420443L, 25.427290379224L, 25.383499457448L,
    25.340811628980L, 25.299218130454L, 25.258710456720L, 25.219280356448L,
    25.180919827884L, 25.143621114760L, 25.107376702347L, 25.072179313649L,
    25.038021905740L, 25.004897666231L, 24.972800009870L, 24.941722575268L,
    24.911659221760L, 24.882604026371L, 24.854551280919L, 24.827495489220L,
    24.801431364419L, 24.776353826422L, 24.752257999445L, 24.729139209670L,
    24.706992982996L, 24.685815042906L, 24.665601308427L, 24.646347892187L,
    24.628051098582L, 24.610707422020L, 24.594313545274L, 24.578866337924L,
    24.564362854886L, 24.550800335034L, 24.538176199912L, 24.526488052533L,
    24.515733676262L, 24.505911033789L, 24.497018266182L, 24.489053692030L,
    24.482015806662L, 24.475903281455L, 24.470714963219L, 24.466449873666L,
    24.463107208963L, 24.460686339356L, 24.459186808886L, 24.458608335175L,
    24.458950809302L, 24.460214295745L, 24.462399032417L, 24.465505430773L,
    24.469534075999L, 24.474485727283L, 24.480361318160L, 24.487161956947L,
    24.494888927249L, 24.503543688554L, 24.513127876906L, 24.523643305660L,
    24.535091966323L, 24.547476029474L, 24.560797845774L, 24.575059947059L,
    24.590265047518L, 24.606416044958L, 24.623516022164L, 24.641568248340L,
    24.660576180644L, 24.680543465821L, 24.701473941920L, 24.723371640112L,
    24.746240786609L, 24.770085804668L, 24.794911316712L, 24.820722146542L,
    24.847523321655L, 24.875320075675L, 24.904117850882L, 24.933922300862L,
    24.964739293265L, 24.996574912678L, 25.029435463622L, 25.063327473663L,
    25.098257696656L, 25.134233116106L, 25.171260948671L, 25.209348647790L,
    25.248503907451L, 25.288734666103L, 25.330049110707L, 25.372455680945L,
    25.415963073568L, 25.460580246918L, 25.506316425597L, 25.553181105310L,
    25.601184057882L, 25.650335336442L, 25.700645280797L, 25.752124522990L,
    25.804783993053L, 25.858634924958L, 25.913688862768L, 25.969957667014L,
    26.027453521277L, 26.086188939001L, 26.146176770541L, 26.207430210453L,
    26.269962805027L, 26.333788460083L, 26.398921449034L, 26.465376421222L,
    26.533168410542L, 26.602312844355L, 26.672825552715L, 26.744722777909L,
    26.818021184322L, 26.892737868648L, 26.968890370446L, 27.046496683067L,
    27.125575264959L, 27.206145051358L, 27.288225466399L, 27.371836435635L,
    27.456998399009L, 27.543732324273L, 27.632059720880L, 27.722002654378L,
    27.813583761303L, 27.906826264611L, 28.001753989657L, 28.098391380758L,
    28.196763518343L, 28.296896136730L, 28.398815642553L, 28.502549133858L,
    28.608124419904L, 28.715570041696L, 28.824915293278L, 28.936190243819L,
    29.049425760532L, 29.164653532450L, 29.281906095110L, 29.401216856166L,
    29.522620121997L, 29.646151125326L, 29.771846053916L, 29.899742080377L,
    30.029877393148L, 30.162291228692L, 30.297023904968L, 30.434116856242L,
    30.573612669281L, 30.715555121023L, 30.859989217765L, 31.006961235953L,
    31.156518764649L, 31.308710749761L, 31.463587540102L, 31.621200935388L,
    31.781604236262L, 31.944852296434L, 32.111001577055L, 32.280110203436L,
    32.452238024215L, 32.627446673118L, 32.805799633420L, 32.987362305278L,
    33.172202076047L, 33.360388393765L, 33.551992843960L, 33.747089229956L,
    33.945753656862L, 34.148064619450L, 34.354103094132L, 34.563952635241L,
    34.777699475889L, 34.995432633618L, 35.217244021140L, 35.443228562431L,
    35.673484314509L, 35.908112595195L, 36.147218117221L, 36.390909129051L,
    36.639297562797L, 36.892499189678L, 37.150633783438L, 37.413825292236L,
    37.682202019499L, 37.955896814300L, 38.235047271849L, 38.519795944723L,
    38.810290565524L, 39.106684281677L, 39.409135903155L, 39.717810163970L,
    40.032877998329L, 40.354516832411L, 40.682910892833L, 41.018251532892L,
    41.360737577825L, 41.710575690367L, 42.067980758020L, 42.433176303563L,
    42.806394920425L, 43.187878734713L, 43.577879895813L, 43.976661097640L,
    44.384496132803L, 44.801670482132L, 45.228481942222L, 45.665241293894L,
    46.112273014715L, 46.569916039002L, 47.038524569043L, 47.518468941606L,
    48.010136554191L, 48.513932855871L, 49.030282408055L, 49.559630020987L,
    50.102441972369L, 50.659207315118L, 51.230439281955L, 51.816676795296L,
    52.418486091777L, 53.036462471690L, 53.671232184690L, 54.323454464314L,
    54.993823725205L, 55.683071938422L, 56.391971201908L, 57.121336525098L,
    57.872028848758L, 58.644958323586L, 59.441087873821L, 60.261437075189L,
    61.107086380035L, 61.979181726449L, 62.878939572745L, 63.807652403808L,
    64.766694761758L, 65.757529860095L, 66.781716848326L, 67.840918802939L,
    68.936911530940L, 70.071593284018L, 71.246995495198L, 72.465294665849L,
    73.728825549462L, 75.040095800402L, 76.401802281169L, 77.816849251561L,
    79.288368698156L, 80.819743103960L, 82.414631007043L, 84.076995755192L,
    85.811137933004L, 87.621732020748L, 89.513867943987L, 91.493098292880L,
    93.565492135266L, 95.737696524017L, 98.017007014219L, 100.411448769477L,
    102.929870161318L, 105.582051167500L, 108.378829374948L, 111.332247018321L,
    114.455723271965L, 117.764257008775L, 121.274666508083L, 125.005874221757L,
    128.979246809526L, 133.219003390427L, 137.752708547383L, 142.611871373382L,
    147.832678194381L, 153.456895164466L, 159.532988596985L, 166.117526979351L,
     0.824675448244L,  0.830452051671L,  0.836195475919L,  0.841900869101L,
     0.847562384922L,  0.853172914163L,  0.858723724208L,  0.864203967624L,
     0.869600000739L,  0.874894420616L,  0.880064674609L,  0.885081003532L,
     0.889903313510L,  0.894476263737L,  0.898721258444L,  0.902522800203L,
     0.905703957724L,  0.907979268043L,  0.908856483498L,  0.907408059144L,
     0.901654011645L,  0.886482065417L,  0.843454032351L, -2.520297596229L,
     1.350552977890L, -2.029078895314L, -2.073549833545L, -2.089124424189L,
    -2.095044818954L, -2.096577593142L, -2.095748935593L, -2.093504107387L,
    -2.090343328604L, -2.086556079349L, -2.082321493390L, -2.077756357584L,
    -2.072940063287L, -2.067928463772L, -2.062761995080L, -2.057470651921L,
    -2.052077153355L, -2.046599022601L, -2.041049992017L, -2.035440975590L,
    -2.029780756664L, -2.024076483672L, -2.018334033612L, -2.012558282682L,
    -2.006753310610L, -2.000922556897L, -1.995068941654L, -1.989194960081L,
    -1.983302757039L, -1.977394186449L, -1.971470859011L, -1.965534180816L,
    -1.959585384844L, -1.953625556803L, -1.947655656485L, -1.941676535501L,
    -1.935688952113L, -1.929693583676L, -1.923691037154L, -1.917681858031L,
    -1.911666537904L, -1.905645520976L, -1.899619209636L, -1.893587969263L,
    -1.887552132388L, -1.881512002305L, -1.875467856213L, -1.869419947967L,
    -1.863368510483L, -1.857313757852L, -1.851255887208L, -1.845195080375L,
    -1.839131505319L, -1.833065317452L, -1.826996660777L, -1.820925668922L,
    -1.814852466053L, -1.808777167700L, -1.802699881496L, -1.796620707838L,
    -1.790539740486L, -1.784457067106L, -1.778372769752L, -1.772286925314L,
    -1.766199605912L, -1.760110879266L, -1.754020809024L, -1.747929455063L,
    -1.741836873768L, -1.735743118279L, -1.729648238722L, -1.723552282423L,
    -1.717455294098L, -1.711357316032L, -1.705258388241L, -1.699158548624L,
    -1.693057833100L, -1.686956275736L, -1.680853908865L, -1.674750763197L,
    -1.668646867917L, -1.662542250780L, -1.656436938197L, -1.650330955317L,
    -1.644224326100L, -1.638117073387L, -1.632009218966L, -1.625900783631L,
    -1.619791787237L, -1.613682248756L, -1.607572186322L, -1.601461617279L,
    -1.595350558224L, -1.589239025044L, -1.583127032958L, -1.577014596550L,
    -1.570901729799L, -1.564788446115L, -1.558674758366L, -1.552560678903L,
    -1.546446219590L, -1.540331391823L, -1.534216206557L, -1.528100674327L,
    -1.521984805265L, -1.515868609122L, -1.509752095285L, -1.503635272794L,
    -1.497518150357L, -1.491400736369L, -1.485283038919L, -1.479165065813L,
    -1.473046824577L, -1.466928322478L, -1.460809566529L, -1.454690563503L,
    -1.448571319943L, -1.442451842172L, -1.436332136300L, -1.430212208238L,
    -1.424092063700L, -1.417971708215L, -1.411851147136L, -1.405730385641L,
    -1.399609428748L, -1.393488281314L, -1.387366948048L, -1.381245433511L,
    -1.375123742126L, -1.369001878181L, -1.362879845834L, -1.356757649122L,
    -1.350635291960L, -1.344512778148L, -1.338390111377L, -1.332267295231L,
    -1.326144333190L, -1.320021228637L, -1.313897984859L, -1.307774605051L,
    -1.301651092320L, -1.295527449688L, -1.289403680095L, -1.283279786399L,
    -1.277155771384L, -1.271031637761L, -1.264907388165L, -1.258783025168L,
    -1.252658551270L, -1.246533968910L, -1.240409280464L, -1.234284488249L,
    -1.228159594520L, -1.222034601482L, -1.215909511279L, -1.209784326008L,
    -1.203659047713L, -1.197533678388L, -1.191408219981L, -1.185282674392L,
    -1.179157043480L, -1.173031329056L, -1.166905532894L, -1.160779656723L,
    -1.154653702237L, -1.148527671090L, -1.142401564898L, -1.136275385243L,
    -1.130149133673L, -1.124022811701L, -1.117896420808L, -1.111769962443L,
    -1.105643438027L, -1.099516848947L, -1.093390196565L, -1.087263482214L,
    -1.081136707200L, -1.075009872801L, -1.068882980273L, -1.062756030844L,
    -1.056629025721L, -1.050501966085L, -1.044374853096L, -1.038247687892L,
    -1.032120471589L, -1.025993205283L, -1.019865890051L, -1.013738526947L,
    -1.007611117011L, -1.001483661260L, -0.995356160697L, -0.989228616305L,
    -0.983101029052L, -0.976973399888L, -0.970845729749L, -0.964718019554L,
    -0.958590270209L, -0.952462482604L, -0.946334657615L, -0.940206796105L,
    -0.934078898923L, -0.927950966906L, -0.921823000879L, -0.915695001653L,
    -0.909566970028L, -0.903438906793L, -0.897310812727L, -0.891182688597L,
    -0.885054535159L, -0.878926353159L, -0.872798143336L, -0.866669906416L,
    -0.860541643117L, -0.854413354150L, -0.848285040214L, -0.842156702003L,
    -0.836028340201L, -0.829899955484L, -0.823771548522L, -0.817643119976L,
    -0.811514670501L, -0.805386200745L, -0.799257711350L, -0.793129202950L,
    -0.787000676175L, -0.780872131648L, -0.774743569987L, -0.768614991802L,
    -0.762486397702L, -0.756357788287L, -0.750229164156L, -0.744100525899L,
    -0.737971874106L, -0.731843209360L, -0.725714532240L, -0.719585843323L,
    -0.713457143181L, -0.707328432382L, -0.701199711493L, -0.695070981074L,
    -0.688942241686L, -0.682813493886L, -0.676684738228L, -0.670555975263L,
    -0.664427205541L, -0.658298429610L, -0.652169648014L, -0.646040861299L,
    -0.639912070005L, -0.633783274675L, -0.627654475848L, -0.621525674063L,
    -0.615396869857L, -0.609268063767L, -0.603139256330L, -0.597010448082L,
    -0.590881639559L, -0.584752831297L, -0.578624023830L, -0.572495217697L,
    -0.566366413432L, -0.560237611573L, -0.554108812657L, -0.547980017224L,
    -0.541851225813L, -0.535722438965L, -0.529593657222L, -0.523464881127L,
    -0.517336111228L, -0.511207348070L, -0.505078592204L, -0.498949844181L,
    -0.492821104556L, -0.486692373884L, -0.480563652725L, -0.474434941642L,
    -0.468306241200L, -0.462177551967L, -0.456048874517L, -0.449920209424L,
    -0.443791557267L, -0.437662918632L, -0.431534294105L, -0.425405684279L,
    -0.419277089751L, -0.413148511122L, -0.407019948999L, -0.400891403994L,
    -0.394762876724L, -0.388634367812L, -0.382505877887L, -0.376377407584L,
    -0.370248957545L, -0.364120528416L, -0.357992120853L, -0.351863735517L,
    -0.345735373077L, -0.339607034210L, -0.333478719600L, -0.327350429938L,
    -0.321222165927L, -0.315093928274L, -0.308965717698L, -0.302837534925L,
    -0.296709380694L, -0.290581255750L, -0.284453160849L, -0.278325096759L,
    -0.272197064257L, -0.266069064131L, -0.259941097183L, -0.253813164222L,
    -0.247685266074L, -0.241557403574L, -0.235429577572L, -0.229301788930L,
    -0.223174038524L, -0.217046327244L, -0.210918655995L, -0.204791025695L,
    -0.198663437280L, -0.192535891699L, -0.186408389921L, -0.180280932929L,
    -0.174153521722L, -0.168026157321L, -0.161898840761L, -0.155771573100L,
    -0.149644355411L, -0.143517188791L, -0.137390074355L, -0.131263013240L,
    -0.125136006606L, -0.119009055635L, -0.112882161530L, -0.106755325520L,
    -0.100628548860L, -0.094501832828L, -0.088375178730L, -0.082248587896L,
    -0.076122061688L, -0.069995601493L, -0.063869208731L, -0.057742884849L,
    -0.051616631328L, -0.045490449681L, -0.039364341454L, -0.033238308227L,
    -0.027112351616L, -0.020986473276L, -0.014860674897L, -0.008734958208L,
    -0.002609324981L,  0.003516222972L,  0.009641683795L,  0.015767055588L,
     0.021892336406L,  0.028017524255L,  0.034142617092L,  0.040267612824L,
     0.046392509305L,  0.052517304334L,  0.058641995656L,  0.064766580957L,
     0.070891057861L,  0.077015423933L,  0.083139676672L,  0.089263813511L,
     0.095387831814L,  0.101511728873L,  0.107635501908L,  0.113759148060L,
     0.119882664393L,  0.126006047887L,  0.132129295438L,  0.138252403852L,
     0.144375369846L,  0.150498190039L,  0.156620860954L,  0.162743379009L,
     0.168865740517L,  0.174987941681L,  0.181109978588L,  0.187231847206L,
     0.193353543380L,  0.199475062825L,  0.205596401122L,  0.211717553714L,
     0.217838515896L,  0.223959282816L,  0.230079849460L,  0.236200210653L,
     0.242320361049L,  0.248440295123L,  0.254560007165L,  0.260679491272L,
     0.266798741338L,  0.272917751047L,  0.279036513861L,  0.285155023013L,
     0.291273271498L,  0.297391252057L,  0.303508957168L,  0.309626379037L,
     0.315743509579L,  0.321860340410L,  0.327976862831L,  0.334093067809L,
     0.340208945969L,  0.346324487570L,  0.352439682489L,  0.358554520203L,
     0.364668989771L,  0.370783079806L,  0.376896778460L,  0.383010073393L,
     0.389122951754L,  0.395235400148L,  0.401347404610L,  0.407458950574L,
     0.413570022840L,  0.419680605539L,  0.425790682093L,  0.431900235181L,
     0.438009246689L,  0.444117697671L,  0.450225568295L,  0.456332837794L,
     0.462439484409L,  0.468545485328L,  0.474650816622L,  0.480755453177L,
     0.486859368616L,  0.492962535223L,  0.499064923853L,  0.505166503840L,
     0.511267242896L,  0.517367107003L,  0.523466060295L,  0.529564064929L,
     0.535661080949L,  0.541757066133L,  0.547851975836L,  0.553945762806L,
     0.560038376996L,  0.566129765350L,  0.572219871577L,  0.578308635899L,
     0.584395994776L,  0.590481880603L,  0.596566221385L,  0.602648940369L,
     0.608729955647L,  0.614809179716L,  0.620886518987L,  0.626961873253L,
     0.633035135089L,  0.639106189192L,  0.645174911641L,  0.651241169081L,
     0.657304817805L,  0.663365702732L,  0.669423656252L,  0.675478496944L,
     0.681530028113L,  0.687578036157L,  0.693622288702L,  0.699662532500L,
     0.705698491026L,  0.711729861742L,  0.717756312965L,  0.723777480268L,
     0.729792962339L,  0.735802316192L,  0.741805051612L,  0.747800624688L,
     0.753788430254L,  0.759767793018L,  0.765737957094L,  0.771698073614L,
     0.777647185978L,  0.783584212193L,  0.789507923644L,  0.795416919375L,
     0.801309594778L,  0.807184103190L,  0.813038308460L,  0.818869725913L,
};

