TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/dsp/dsp_fpu_fft_fpu64_f2838x.c
#define TEST_SIZE       (512U)

//
// Used for memory alignment
//
#ifdef __cplusplus
#pragma DATA_SECTION("FFT_buffer_1")
#else
#pragma DATA_SECTION(test_input, "FFT_buffer_1")
#endif
#ifdef __cplusplus
#pragma DATA_SECTION("FFT_buffer_2")
#else
#pragma DATA_SECTION(test_output, "FFT_buffer_2")
#endif

float64_t test_output[TEST_SIZE << 1];
float64_t *inPtr = test_input;
float64_t *outPtr = test_output;
uint16_t pass = 0U, fail = 0U;
float64_t tolerance = 1.2e-5;

//
// Main
//
void main(void)
{
    //
    // CPU initialization
    //
    Device_init();
    Device_initGPIO();
    Interrupt_initModule();
    Interrupt_initVectorTable();
    Board_init();
    C2000Ware_libraries_init();

    //
    // Local variables
    //
    int16_t i, j;
    float64u_t out, gold, errld;

    //
    // Run the calculation function
    //
    myCFFT0_handle->calc(myCFFT0_handle);

    //
    // Verify results
    //
    for(i = 0U; i < (TEST_SIZE << 1); i++)
    {
        out.f64 = myCFFT0_handle->p_currInput[i];
        gold.f64 = test_golden[i];
        errld.f64 = fabsf(out.f64 - gold.f64);
        if(errld.f64 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
    }

    //
    // Run the magnitude function
    //
    myCFFT0_handle->mag(myCFFT0_handle);

    //
    // Verify results
    //
    for(i = (TEST_SIZE << 1), j=0U; i < (3U*TEST_SIZE); i++, j++)
    {
        out.f64 = myCFFT0_handle->p_currOutput[j];
        gold.f64 = test_golden[i];
        errld.f64 = fabsf(out.f64 - gold.f64);
        if(errld.f64 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
    }

    //
    // Run the phase function
    //
    myCFFT0_handle->phase(myCFFT0_handle);

    //
    // Verify results
    //
    for(i = (3U*TEST_SIZE), j=0U; i < (4U*TEST_SIZE); i++, j++)
    {
        out.f64 = myCFFT0_handle->p_currOutput[j];
        gold.f64 = test_golden[i];
        errld.f64 = fabsf(out.f64 - gold.f64);
        if(errld.f64 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }

    }
    while(1);
}

//
// End of File
//
